Tekla Open API Reference for Tekla Structures 2025
PourAttributes Properties
The PourObject.PourAttributes type exposes the following members.
Properties
Name | Description
DrawChamfers
 True if chamfers are drawn.
DrawHiddenLines
 True if hidden lines are drawn.
DrawOwnHiddenLines
 True if own hidden lines are drawn.
FaceHatch
 The hatch type of the face hatch.
HiddenLines
 The line type of hidden lines.
OwnHiddenLines
 The line type of own hidden lines.
SectionFaceHatch
 The hatch type of the section face hatch.
SectionLines
 The line type of section lines.
VisibleLines
 The line type of visible lines.
Top
See Also
Reference
PourObject.PourAttributes Class
Tekla.Structures.Drawing Namespace